<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"84b5cc7a2fd05abdceb8ed4ae94608ce0a56b14b0077f535830e474e5b7c8dd8","plan_job_ref":"Job Environment Main - Plan #39 at https://github.com/jarrod-lowe/wildsea/actions/runs/10336477865","plan_out_hash":"865aebf57eeff63421296323c247ce341f03a91de053d8ad956d04053ea89ba7","plan_hash":"9e9dab061d21c50e96003bdb3f7bdf503f91fd4c38fbdf22fb2781df60c3ed72","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
aws_account  = (sensitive value)
aws_region   = (sensitive value)
environment  = "primary"
state_bucket = "terraform-state-021891603679"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_dynamodb_table.table will be created
+   resource "aws_dynamodb_table" "table" {
+       arn                         = (known after apply)
+       billing_mode                = "PAY_PER_REQUEST"
+       deletion_protection_enabled = true
+       hash_key                    = "**"
+       id                          = (known after apply)
+       name                        = "Wildsea-primary"
+       range_key                   = "**"
+       read_capacity               = (known after apply)
+       stream_arn                  = (known after apply)
+       stream_label                = (known after apply)
+       stream_view_type            = (known after apply)
+       tags                        = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all                    = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
+       write_capacity              = (known after apply)

+       attribute {
+           name = "PK"
+           type = "S"
        }
+       attribute {
+           name = "SK"
+           type = "S"
        }

+       point_in_time_recovery {
+           enabled = true
        }

+       server_side_encryption (known after apply)

+       ttl (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #39](https://github.com/jarrod-lowe/wildsea/actions/runs/10336477865)